; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v1 ?v13)
             (pred_12 ?v3 ?v12)
             (pred_4 ?v1 ?v12)
             (pred_3 ?v6 ?v1 )
	     (pred_5 ?v1)
             (pred_11 ?v7)
             (pred_1 ?v3)
             (pred_10 ?v12)
             (pred_9 ?v1)
             (pred_2 ?v3)
             (pred_6 ?v1)
             (pred_7 ))



(:action op_5
:parameters (?v2 ?v9 ?v8 ?v5)
:precondition (and (pred_11 ?v2) (pred_11 ?v9) (pred_1 ?v8) (pred_10 ?v5)
          (pred_8 ?v2 ?v9) (pred_12 ?v8 ?v5)
                   (pred_4 ?v9 ?v5) (pred_5 ?v2) 
                   (pred_9 ?v9) (pred_2 ?v8))
:effect (and  (pred_6 ?v9) (not (pred_9 ?v9))))


(:action op_2
:parameters (?v2 ?v11)
:precondition (and (pred_11 ?v2) (pred_11 ?v11)
               (pred_5 ?v2) (pred_8 ?v2 ?v11) (pred_6 ?v11))
:effect (and (pred_5 ?v11) (not (pred_5 ?v2))))

(:action op_3
:parameters (?v2 ?v8)
:precondition (and (pred_11 ?v2) (pred_1 ?v8) 
                  (pred_5 ?v2) (pred_3 ?v8 ?v2) (pred_7 ))
:effect (and (pred_2 ?v8)
   (not (pred_3 ?v8 ?v2)) (not (pred_7 ))))


(:action op_4
:parameters (?v2 ?v10 ?v4)
:precondition (and (pred_11 ?v2) (pred_1 ?v10) (pred_1 ?v4)
                  (pred_5 ?v2) (pred_2 ?v4) (pred_3 ?v10 ?v2))
:effect (and (pred_2 ?v10) (pred_3 ?v4 ?v2)
        (not (pred_2 ?v4)) (not (pred_3 ?v10 ?v2))))

(:action op_1
:parameters (?v2 ?v8)
:precondition (and (pred_11 ?v2) (pred_1 ?v8) 
                  (pred_5 ?v2) (pred_2 ?v8))
:effect (and (pred_7 ) (pred_3 ?v8 ?v2) (not (pred_2 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_05 obj_29 obj_16 obj_13 obj_21 obj_10 obj_14 obj_04 obj_03 obj_31 obj_30 obj_12 obj_22 obj_11 obj_18 obj_27 obj_17 obj_23 obj_01 obj_20 obj_24 obj_25 obj_08 obj_07 obj_09
    obj_19 obj_26 obj_15
    obj_32 obj_28 obj_02 obj_06
    )

    (:init
       (pred_7)

       (pred_11 obj_05)
       (pred_11 obj_29)
       (pred_11 obj_16)
       (pred_11 obj_13)
       (pred_11 obj_21)
       (pred_11 obj_10)
       (pred_11 obj_14)
       (pred_11 obj_04)
       (pred_11 obj_03)
       (pred_11 obj_31)
       (pred_11 obj_30)
       (pred_11 obj_12)
       (pred_11 obj_22)
       (pred_11 obj_11)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_11 obj_17)
       (pred_11 obj_23)
       (pred_11 obj_01)
       (pred_11 obj_20)
       (pred_11 obj_24)
       (pred_11 obj_25)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_10 obj_19)
       (pred_10 obj_26)
       (pred_10 obj_15)
       (pred_1 obj_32)
       (pred_1 obj_28)
       (pred_1 obj_02)
       (pred_1 obj_06)

       (pred_8 obj_05 obj_10)
       (pred_8 obj_05 obj_29)
       (pred_8 obj_29 obj_14)
       (pred_8 obj_29 obj_16)
       (pred_8 obj_29 obj_05)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_16 obj_13)
       (pred_8 obj_16 obj_29)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_21)
       (pred_8 obj_13 obj_16)
       (pred_8 obj_21 obj_31)
       (pred_8 obj_21 obj_13)
       (pred_8 obj_10 obj_30)
       (pred_8 obj_10 obj_14)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_14 obj_12)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_14 obj_29)
       (pred_8 obj_14 obj_10)
       (pred_8 obj_04 obj_22)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_03 obj_31)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_31 obj_18)
       (pred_8 obj_31 obj_21)
       (pred_8 obj_31 obj_03)
       (pred_8 obj_30 obj_27)
       (pred_8 obj_30 obj_12)
       (pred_8 obj_30 obj_10)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_12 obj_22)
       (pred_8 obj_12 obj_14)
       (pred_8 obj_12 obj_30)
       (pred_8 obj_22 obj_23)
       (pred_8 obj_22 obj_11)
       (pred_8 obj_22 obj_04)
       (pred_8 obj_22 obj_12)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_11 obj_22)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_18 obj_31)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_27 obj_24)
       (pred_8 obj_27 obj_17)
       (pred_8 obj_27 obj_30)
       (pred_8 obj_17 obj_25)
       (pred_8 obj_17 obj_23)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_17 obj_27)
       (pred_8 obj_23 obj_08)
       (pred_8 obj_23 obj_01)
       (pred_8 obj_23 obj_22)
       (pred_8 obj_23 obj_17)
       (pred_8 obj_01 obj_07)
       (pred_8 obj_01 obj_20)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_01 obj_23)
       (pred_8 obj_20 obj_09)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_01)
       (pred_8 obj_24 obj_25)
       (pred_8 obj_24 obj_27)
       (pred_8 obj_25 obj_08)
       (pred_8 obj_25 obj_17)
       (pred_8 obj_25 obj_24)
       (pred_8 obj_08 obj_07)
       (pred_8 obj_08 obj_23)
       (pred_8 obj_08 obj_25)
       (pred_8 obj_07 obj_09)
       (pred_8 obj_07 obj_01)
       (pred_8 obj_07 obj_08)
       (pred_8 obj_09 obj_20)
       (pred_8 obj_09 obj_07)
       (pred_9 obj_17)
       (pred_9 obj_20)
       (pred_9 obj_07)
       (pred_9 obj_29)
       (pred_4  obj_17 obj_19)
       (pred_4  obj_20 obj_26)
       (pred_4  obj_07 obj_15)
       (pred_4  obj_29 obj_26)
       (pred_6 obj_05)
       (pred_6 obj_16)
       (pred_6 obj_13)
       (pred_6 obj_21)
       (pred_6 obj_10)
       (pred_6 obj_14)
       (pred_6 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_31)
       (pred_6 obj_30)
       (pred_6 obj_12)
       (pred_6 obj_22)
       (pred_6 obj_11)
       (pred_6 obj_18)
       (pred_6 obj_27)
       (pred_6 obj_23)
       (pred_6 obj_01)
       (pred_6 obj_24)
       (pred_6 obj_25)
       (pred_6 obj_08)
       (pred_6 obj_09)

       (pred_12  obj_32 obj_19)
       (pred_12  obj_28 obj_26)
       (pred_12  obj_02 obj_15)
       (pred_12  obj_06 obj_26)
       (pred_3 obj_32 obj_04)
       (pred_3 obj_28 obj_23)
       (pred_3 obj_02 obj_18)
       (pred_3 obj_06 obj_16)
       (pred_5 obj_08)
    )

    (:goal (and
       (pred_3 obj_32 obj_22)
       (pred_3 obj_28 obj_10)
       (pred_3 obj_02 obj_12)
    ))
(:constraints
  (always (not (pred_5 obj_11)))
)
)

; plan
1. (op_2 obj_08 obj_23)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_23)
   goals met: 0 of 3
2. (op_2 obj_23 obj_22)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_22)
   goals met: 0 of 3
3. (op_2 obj_22 obj_04)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_04)
   goals met: 0 of 3
4. (op_3 obj_04 obj_32)
   deleted: (pred_3 obj_32 obj_04) (pred_7)
   added: (pred_2 obj_32)
   goals met: 0 of 3
5. (op_2 obj_04 obj_22)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_22)
   goals met: 0 of 3
6. (op_1 obj_22 obj_32)
   deleted: (pred_2 obj_32)
   added: (pred_7) (pred_3 obj_32 obj_22)
   goals met: 1 of 3
7. (op_2 obj_22 obj_12)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_12)
   goals met: 1 of 3
8. (op_2 obj_12 obj_14)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_14)
   goals met: 1 of 3
9. (op_2 obj_14 obj_04)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_04)
   goals met: 1 of 3
10. (op_2 obj_04 obj_03)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_03)
   goals met: 1 of 3
11. (op_2 obj_03 obj_31)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_31)
   goals met: 1 of 3
12. (op_2 obj_31 obj_18)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_18)
   goals met: 1 of 3
13. (op_3 obj_18 obj_02)
   deleted: (pred_3 obj_02 obj_18) (pred_7)
   added: (pred_2 obj_02)
   goals met: 1 of 3
14. (op_2 obj_18 obj_31)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_31)
   goals met: 1 of 3
15. (op_2 obj_31 obj_03)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_03)
   goals met: 1 of 3
16. (op_2 obj_03 obj_04)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_04)
   goals met: 1 of 3
17. (op_2 obj_04 obj_22)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_22)
   goals met: 1 of 3
18. (op_2 obj_22 obj_12)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_12)
   goals met: 1 of 3
19. (op_1 obj_12 obj_02)
   deleted: (pred_2 obj_02)
   added: (pred_7) (pred_3 obj_02 obj_12)
   goals met: 2 of 3
20. (op_2 obj_12 obj_22)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_22)
   goals met: 2 of 3
21. (op_2 obj_22 obj_23)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_23)
   goals met: 2 of 3
22. (op_3 obj_23 obj_28)
   deleted: (pred_3 obj_28 obj_23) (pred_7)
   added: (pred_2 obj_28)
   goals met: 2 of 3
23. (op_2 obj_23 obj_22)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_22)
   goals met: 2 of 3
24. (op_2 obj_22 obj_04)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_04)
   goals met: 2 of 3
25. (op_2 obj_04 obj_14)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_14)
   goals met: 2 of 3
26. (op_2 obj_14 obj_10)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_10)
   goals met: 2 of 3
27. (op_1 obj_10 obj_28)
   deleted: (pred_2 obj_28)
   added: (pred_7) (pred_3 obj_28 obj_10)
   goals met: 3 of 3
